<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.1 
# *Data Wrangling and Munging with Pandas*

## Part 1: Wrangling Data

The term "data wrangling" is analogous to capturing wild horses and getting them into a fenced area; the horses are data and the fencing is your computer. The more common data wrangling tasks include:

- reading flat files
- reading Excel files
- downloading from web pages
  - csv
  - html
  - json

In [19]:
import numpy as np
import pandas as pd

*It is good practice to display the library version numbers for future reference:*

In [20]:
print('Numpy: ', np.__version__)
print('Pandas: ', pd.__version__)

Numpy:  1.23.3
Pandas:  1.4.4

### CSV Files

Below are three attempts to load the file "bikeshare.csv" into a DataFrame named `bikes`. Why are they wrong?

In [21]:
# wrong:
bikes = pd.read_table("C:\\Users\\stoll\\iod_ipynb\\DATA\\bikeshare.csv", header = None)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table("C:\\Users\\stoll\\iod_ipynb\\DATA\\bikeshare.csv", header = 1)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table("C:\\Users\\stoll\\iod_ipynb\\DATA\\bikeshare.csv", header = 0)
print(bikes.head())

                                                   0
0  instant,dteday,season,yr,mnth,hr,holiday,weekd...
1  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,...
2  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
3  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
4  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...

  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0,3,13,16
0  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
1  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
2  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...
3  5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,...
4  6,2011-01-01,1,0,1,5,0,6,0,2,0.24,0.2576,0.75,...

  instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,...
1  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
2  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
3  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...
4  5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,...

In [22]:
# from google.colab import drive
# drive.mount('/content/drive')

?:
ANSWER: Case 1 treats headings as just another data row. Case 2 treats the 1st data row as the column header. Case 3 gets the header right (row 0), but reads each row as a single column (Nb. the other two make that same mistake).

Load the file "bikeshare.csv" into a DataFrame named `bikes`, and confirm that it was loaded properly:

In [23]:
#ANSWER:
bikes = pd.read_table("C:\\Users\\stoll\\iod_ipynb\\DATA\\bikeshare.csv", sep=',') #arg header is not required here
bikes.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1

Note that we could have used `read.csv()` above. When is `read_table()` necessary?

?:
ANSWER: When `sep` is not the comma character, or we need fine control that `read.csv()` does not provide.

Flat files can be full of surprises. Here are some issues to watch out for:

- separator character is something other than the comma
  - ";", "|", and tab are popular
- newline character is something other than what the O/S expects 
  - Tip: Don't hard-code the character codes for carriage returns, linefeeds, etc. Use Python's built-in representation instead (e.g. Python translates "\n" to the newline character and "\t" to the tab character on any O/S).
- truncated lines
  - if there are empty fields at the end of a line it is possible that their separators will be missing, resulting in a "jagged" file
- embedded commas or quotes
  - a free-text field containing embedded commas may split into separate fields on input
  - a free-text field containing embedded quotes may not parse correctly
- unescaped characters
  - the "\" character indicates a control code to Python, which will break the I/O
    - e.g. the substring "\u0123" will be interpreted as Unicode(0123) -- which may not be what the file creator intended
  - these may need to be fixed by loading whole strings and then parsing into a new data frame
  
Tip: Most issues can be delth with by correctly specifying the parameters of the function you use to load the file. Read the doco before reading the data!

### Reading Excel Files

In [24]:
from pandas import ExcelFile  # Nb. Need to install xlrd from conda (it does not automatically install with pandas)

In [25]:
df = pd.read_excel('C:\\Users\\stoll\\iod_ipynb\\DATA\\Iris.xls', sheet_name = 'Data')
df

,Species_No,Petal_width,Petal_length,Sepal_width,Sepal_length,Species_name
0,1,0.2,1.4,3.5,5.1,Setosa
1,1,0.2,1.4,3.0,4.9,Setosa
2,1,0.2,1.3,3.2,4.7,Setosa
3,1,0.2,1.5,3.1,4.6,Setosa
4,1,0.2,1.4,3.6,5.0,Setosa
...,...,...,...,...,...,...
145,3,2.3,5.2,3.0,6.7,Verginica
146,3,1.9,5.0,2.5,6.3,Verginica
147,3,2.0,5.2,3.0,6.5,Verginica
148,3,2.3,5.4,3.4,6.2,Verginica
149,3,1.8,5.1,3.0,5.9,Verginica

So, this file appears to have an embedded table of aggregates on the same sheet as the raw data (a naughty but common practice amongst analysts).

It is usually better to load data correctly than to meddle with the source file or load it 'warts and all' and then try to parse it in code. The Pandas functions for reading files have parameters that provide the control we need. For example, we could make multiple calls to `read_excel()`, using combinations of the `header`, `usecols`, `skiprows`, `nrows`, and `skipfooter` parameters to load one table at a time from a spreadsheet with multiple tables.

Load the above file without the unwanted columns:

In [26]:
#ANSWER
df = pd.read_excel('C:\\Users\\stoll\\iod_ipynb\\DATA\\Iris.xls', sheet_name = 'Data', usecols=[0,1,2,3,4]) #load w/o Species_name
df

     Species_No  Petal_width  Petal_length  Sepal_width  Sepal_length
0             1          0.2           1.4          3.5           5.1
1             1          0.2           1.4          3.0           4.9
2             1          0.2           1.3          3.2           4.7
3             1          0.2           1.5          3.1           4.6
4             1          0.2           1.4          3.6           5.0
..          ...          ...           ...          ...           ...
145           3          2.3           5.2          3.0           6.7
146           3          1.9           5.0          2.5           6.3
147           3          2.0           5.2          3.0           6.5
148           3          2.3           5.4          3.4           6.2
149           3          1.8           5.1          3.0           5.9

[150 rows x 5 columns]

### Importing Data Directly from the Web

We usually want to store a local copy of a data file that we download from the Web, but when data retention is not a priority it is convenient to download the data directly into our running Python environment.

#### Importing Text Files from the Web

The web is the 'wild west' of data formats. However, we can usually expect good behaviour from files that are automatically generated by a service, such as the earthquake report:

In [27]:
df = pd.read_csv('https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/2.5_hour.csv')
df.head()

,time,latitude,longitude,depth,mag,magType,nst,gap,dmin,rms,...,updated,place,type,horizontalError,depthError,magError,magNst,status,locationSource,magSource
0,2022-11-24T04:05:48.460Z,17.929333,-66.902500,3.95,2.99,md,25,200,0.04304,0.21,...,2022-11-24T04:26:13.080Z,"4 km S of Guánica, Puerto Rico",earthquake,0.51,0.38,0.088563,9,reviewed,pr,pr
1,2022-11-24T03:36:12.610Z,17.888167,-66.581833,11.54,2.65,md,11,212,0.15550,0.13,...,2022-11-24T03:46:40.360Z,"14 km SSE of Ponce, Puerto Rico",earthquake,0.55,0.45,0.058873,6,reviewed,pr,pr

#### Importing HTML Files from the Web

Working with unstructured HTML files relies heavily on library functions. This one, however, is well-structured:

In [28]:
import lxml #Need to install lxml from conda
url = 'https://www.ccra.com/airport-codes/'

df = pd.read_html(url) 
df #stored as list

[                City      Country Code
 0            Aalborg      Denmark  AAL
 1           Aalesund       Norway  AES
 2             Aarhus      Denmark  AAR
 3     Abbotsford, BC       Canada  YXX
 4     Abbotsford, BC       Canada  YXX
 ...              ...          ...  ...
 1574        Zanzibar     Tanzania  ZNZ
 1575        Zaragoza        Spain  ZAZ
 1576       Zhengzhou        China  CGO
 1577        Zhoushan        China  HSN
 1578          Zurich  Switzerland  ZRH

 [1579 rows x 3 columns]]

In [29]:
df[0] #access table as list element

                City      Country Code
0            Aalborg      Denmark  AAL
1           Aalesund       Norway  AES
2             Aarhus      Denmark  AAR
3     Abbotsford, BC       Canada  YXX
4     Abbotsford, BC       Canada  YXX
...              ...          ...  ...
1574        Zanzibar     Tanzania  ZNZ
1575        Zaragoza        Spain  ZAZ
1576       Zhengzhou        China  CGO
1577        Zhoushan        China  HSN
1578          Zurich  Switzerland  ZRH

[1579 rows x 3 columns]

#### Importing XML Files from the Web

XML files are semi-structured, but you're at the mercy of the file creator. If every record has the same format it will be much easier, but practical applications often require a lot of custom code. Here is an example that includes a nice parser class: http://www.austintaylor.io/lxml/python/pandas/xml/dataframe/2016/07/08/convert-xml-to-pandas-dataframe/

#### Importing JSON Files from the Web

Like XML, JSON files are semi-structured and may require work to capture the schema into a dataframe. Here is a simple example:

In [30]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url, orient = 'columns') #orientation in columns
df.head()

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0

## Part 2: Data Munging

Data munging is manipulating data to get it into a form that we can start running analyses on (which usually means getting the data into a DataFrame). Before we get to this stage, we may need to remove headers or footers, transpose columns to rows, split wide data tables into long ones, and so on. (Nb. Excel files can be particularly troublesome, because users can format their data in mixed, complex shapes.) Essentially, we need to follow Hadley Wickham's guidelines for tidy datasets (http://vita.had.co.nz/papers/tidy-data.html):

The end goal of the cleaning data process:

- each variable should be in one column
- each observation should comprise one row
- each type of observational unit should form one table
- include key columns for linking multiple tables
- the top row contains (sensible) variable names
- in general, save data as one file per table

### Dataset Morphology

Once we have our dataset in a DataFrame (or Series, if our data is only 1-dimensional), we can start examining its size and content.

How many rows and columns are in `bikes`?

In [31]:
#ANSWER
bikes.shape

(17379, 17)

What are the column names in `bikes`?

In [32]:
#ANSWER
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

What are the data types of these columns?

In [33]:
#ANSWER
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

What is the (row) index for this DataFrame?

In [34]:
#ANSWER
bikes.index

RangeIndex(start=0, stop=17379, step=1)

https://www.dataquest.io/blog/python-json-tutorial/

## Slicing and Dicing

It is often preferable to refer to DataFrame columns by name, but there is more than one way to do this. 
Do `bikes['season']` and `bikes[['season']]` give the same object? Demonstrate:

In [35]:
#ANSWER
print(type(bikes['season']))
bikes['season']

<class 'pandas.core.series.Series'>

0        1
1        1
2        1
3        1
4        1
        ..
17374    1
17375    1
17376    1
17377    1
17378    1
Name: season, Length: 17379, dtype: int64

In [36]:
#ANSWER
print(type(bikes[['season']]))
bikes[['season']]

<class 'pandas.core.frame.DataFrame'>

       season
0           1
1           1
2           1
3           1
4           1
...       ...
17374       1
17375       1
17376       1
17377       1
17378       1

[17379 rows x 1 columns]

How would we use object notation to show the first 4 rows of `atemp`?

In [37]:
#ANSWER
bikes.atemp[:4]

0    0.2879
1    0.2727
2    0.2727
3    0.2879
Name: atemp, dtype: float64

Algorithms that loop over multiple columns often access DataFrame columns by index. However, none of the following work (try them out by uncommenting / removing the "#E: " ):

In [38]:
bikes[[0]]
#E: bikes[0]
#E: bikes[0,0]
#E: bikes[[0,0]]

KeyError: "None of [Int64Index([0], dtype='int64')] are in the [columns]"

What is the correct way to access the 1st row of the DataFrame by its index?

In [39]:
#ANSWER
bikes.iloc[0]

instant                1
dteday        2011-01-01
season                 1
yr                     0
mnth                   1
hr                     0
holiday                0
weekday                6
workingday             0
weathersit             1
temp                0.24
atemp             0.2879
hum                 0.81
windspeed            0.0
casual                 3
registered            13
cnt                   16
Name: 0, dtype: object

In [40]:
#access first 4 rows using iloc
bikes.iloc[:4]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13

In [41]:
#access first 4 rows using object notation
bikes[:4]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13

What is the correct way to access the 2nd column of the DataFrame by its index?

In [42]:
#ANSWER
bikes.iloc[:, 1]

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4        2011-01-01
            ...
17374    2012-12-31
17375    2012-12-31
17376    2012-12-31
17377    2012-12-31
17378    2012-12-31
Name: dteday, Length: 17379, dtype: object

## Handling Missing Values

What is the Pandas `isnull` function for?

?
ANSWER: Detect missing values

We can apply `isnull` to the `bikes` DataFrame to show the result for every element:

In [43]:
bikes.isnull().head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

However, we usually start at a higher level. How many nulls are in `bikes` altogether?

In [44]:
#ANSWER
bikes.isnull().sum().sum()

0

If this result were nonzero we would next want to find out which columns contained nulls. How can this be done in one line of code?

In [45]:
#ANSWER
bikes.isnull().sum()
#or 
#pd.isna(bikes).sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

What is the Numpy object `nan` used for? (Write a descriptive answer.)

?
ANSWER: Marking a data point as invalid.

Write (and verify) a function that performs scalar division with built-in handling of the edge case (i.e. return a value instead of just trapping the error):

In [46]:
#ANSWER
def divide(dividend, divisor):
    if divisor == 0:
        quotient = np.nan
    else:
        quotient = dividend / divisor
    return quotient

print(divide(1, 0))

nan

Apply the Pandas `isna` function to the following data objects:

In [47]:
x = 2.3
y = np.nan
print(x, y)

2.3 nan

In [48]:
#ANSWER
pd.isna(x), pd.isna(y)

(False, True)

In [49]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array)

[[ 1. nan  3.]
 [ 4.  5. nan]]

In [50]:
#ANSWER
pd.isna(array)

array([[False,  True, False],
       [False, False,  True]])

How is the pandas I/O parameter `na_values` used?

? ANSWER: na_values is used to create additional strings to be recognized by pandas as NaN

In [ ]:
pd.read_csv(na_values=['n/a', '0', '?'])

## Data Profiling

### Counts

When there are categorical variables in a dataset we will want to know how many possible values there are in each column. (Nb. If the dataset is a sample of a larger one, our sample may not capture all possible values of every categorical.)

How many (different) seasons are in `bikes`?

In [52]:
#ANSWER
bikes.season.value_counts()

3    4496
2    4409
1    4242
4    4232
Name: season, dtype: int64

### Ranges

Print the range of the `instant`, `dteday`, and `windspeed` columns:

In [53]:
bikes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 17 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     17379 non-null  int64
 1   dteday      17379 non-null  object
 2   season      17379 non-null  int64
 3   yr          17379 non-null  int64
 4   mnth        17379 non-null  int64
 5   hr          17379 non-null  int64
 6   holiday     17379 non-null  int64
 7   weekday     17379 non-null  int64
 8   workingday  17379 non-null  int64
 9   weathersit  17379 non-null  int64
 10  temp        17379 non-null  float64
 11  atemp       17379 non-null  float64
 12  hum         17379 non-null  float64
 13  windspeed   17379 non-null  float64
 14  casual      17379 non-null  int64
 15  registered  17379 non-null  int64
 16  cnt         17379 non-null  int64
dtypes: float64(4), int64(12), object(1)
memory usage: 2.3+ MB

In [54]:
#ANSWER
bikes['dteday'] = pd.to_datetime(bikes.dteday) #convert to datetime object

print('Range for the instant column is:', bikes.instant.max() - bikes.instant.min())
print('Range for the dteday column is:', bikes.dteday.max() - bikes.dteday.min())
print('Range for the windspeed column is:', bikes.windspeed.max() - bikes.windspeed.min())

Range for the instant column is: 17378
Range for the dteday column is: 730 days 00:00:00
Range for the windspeed column is: 0.8507

In [55]:
print('instant:', bikes['instant'].min(), 'to', bikes['instant'].max())
print('dteday:', bikes['dteday'].min(), 'to', bikes['dteday'].max())
print('windspeed:', bikes['windspeed'].min(), 'to', bikes['windspeed'].max())

instant: 1 to 17379
dteday: 2011-01-01 00:00:00 to 2012-12-31 00:00:00
windspeed: 0.0 to 0.8507

In [56]:
bikes.describe()

,instant,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
count,17379.0000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000
mean,8690.0000,2.501640,0.502561,6.537775,11.546752,0.028770,3.003683,0.682721,1.425283,0.496987,0.475775,0.627229,0.190098,35.676218,153.786869,189.463088
std,5017.0295,1.106918,0.500008,3.438776,6.914405,0.167165,2.005771,0.465431,0.639357,0.192556,0.171850,0.192930,0.122340,49.305030,151.357286,181.387599
min,1.0000,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.020000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,4345.5000,2.000000,0.000000,4.000000,6.000000,0.000000,1.000000,0.000000,1.000000,0.340000,0.333300,0.480000,0.104500,4.000000,34.000000,40.000000
50%,8690.0000,3.000000,1.000000,7.000000,12.000000,0.000000,3.000000,1.000000,1.000000,0.500000,0.484800,0.630000,0.194000,17.000000,115.000000,142.000000
75%,13034.5000,3.000000,1.000000,10.000000,18.000000,0.000000,5.000000,1.000000,2.000000,0.660000,0.621200,0.780000,0.253700,48.000000,220.000000,281.000000
max,17379.0000,4.000000,1.000000,12.000000,23.000000,1.000000,6.000000,1.000000,4.000000,1.000000,1.000000,1.000000,0.850700,367.000000,886.000000,977.000000

Compute and print the overall minimum and maximum of the numeric data columns:

In [57]:
bikes_min, bikes_max = min(bikes.min(numeric_only=True)), max(bikes.max(numeric_only=True)) #skip non-numeric values for calc.
bikes_min, bikes_max

(0.0, 17379.0)

In [58]:
bikes_min, bikes_max = bikes.min(numeric_only=True), bikes.max(numeric_only=True)
bikes_min, bikes_max

(instant       1.00
 season        1.00
 yr            0.00
 mnth          1.00
 hr            0.00
 holiday       0.00
 weekday       0.00
 workingday    0.00
 weathersit    1.00
 temp          0.02
 atemp         0.00
 hum           0.00
 windspeed     0.00
 casual        0.00
 registered    0.00
 cnt           1.00
 dtype: float64,
 instant       17379.0000
 season            4.0000
 yr                1.0000
 mnth             12.0000
 hr               23.0000
 holiday           1.0000
 weekday           6.0000
 workingday        1.0000
 weathersit        4.0000
 temp              1.0000
 atemp             1.0000
 hum               1.0000
 windspeed         0.8507
 casual          367.0000
 registered      886.0000
 cnt             977.0000
 dtype: float64)

### Quantiles

Pandas makes computing quantiles easy. This is how to get the median of a Series:

In [59]:
bikes['atemp'].quantile(0.5)

0.4848

Of course, the `quantiles` method can take a tuple as its argument. Compute the 10th, 25th, 50th, 75th, and 90th percentiles in one line of code:

In [60]:
#ANSWER
bikes['atemp'].quantile([0.1, 0.25, 0.5, 0.75, 0.9])

0.10    0.2424
0.25    0.3333
0.50    0.4848
0.75    0.6212
0.90    0.6970
Name: atemp, dtype: float64

### Cuts

Sometimes we want to split the sample not by the quantiles of the distribution but by the range of the data. Let's take a closer look at `atemp`:

In [61]:
type(bikes['atemp'])

pandas.core.series.Series

In [62]:
bikes.sample(5)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
16435,16436,2012-11-22,4,1,11,13,1,4,0,1,0.46,0.4545,0.31,0.0000,125,144,269
12431,12432,2012-06-07,2,1,6,4,0,4,1,1,0.46,0.4545,0.88,0.1045,0,6,6
11648,11649,2012-05-05,2,1,5,13,0,6,0,1,0.74,0.6818,0.55,0.1343,217,307,524
3290,3291,2011-05-22,2,0,5,0,0,0,0,1,0.54,0.5152,0.88,0.1642,31,100,131
2825,2826,2011-05-02,2,0,5,15,0,1,1,1,0.66,0.6212,0.61,0.1940,45,110,155

Suppose we decide to sort these values into 4 bins of equal width, but we want to apply the resulting groups to the entire DataFrame. Basically, we need to add a row label that indcates which bin each sample belongs in. Let's call this label "atemp_level", and use the `cut` method to populate it:

In [63]:
atemp_level = pd.cut(bikes['atemp'], bins = 4)

What is `atemp_level`?

In [64]:
#ANSWER: Category
type(atemp_level)

pandas.core.series.Series

Here is a random sample of `atemp_level`:

In [65]:
atemp_level.sample(5)

3249       (0.25, 0.5]
527     (-0.001, 0.25]
6739       (0.5, 0.75]
7166       (0.25, 0.5]
510     (-0.001, 0.25]
Name: atemp, dtype: category
Categories (4, interval[float64, right]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

So, by default, `cut` produces labels that indicate the bin boundaries for each element in the series it was applied to. Usually, we will specify labels that are appropriate to the discretisation we are applying:

In [66]:
atemp_level = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])
atemp_level.sample(5)

12537    warm
5591     warm
6598     warm
5090     warm
11973    mild
Name: atemp, dtype: category
Categories (4, object): ['cool' < 'mild' < 'warm' < 'hot']

Incorporate the new `atemp_level` column into the `bikes` DataFrame and use it to count the number of "mild" `atemp` entries in `season` 2:

In [67]:
#ANSWER
bikes['atemp_level'] = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])

#counts for atemp in all seasons
bikes.atemp_level.value_counts()

mild    7507
warm    7223
cool    1952
hot      697
Name: atemp_level, dtype: int64

In [68]:
#counts for atemp in season 2
bikes[bikes.season == 2]['atemp_level'].value_counts()

warm    2392
mild    1829
hot       98
cool      90
Name: atemp_level, dtype: int64

In [69]:
#counts for atemp 'mild' in season 2
len(bikes[(bikes.season == 2) & (bikes.atemp_level == 'mild')])

1829

In [70]:
# Alternatively
#bikes['atemp_level'] = atemp_level
#bikes[(bikes.atemp_level == 'mild') & (bikes.season == 2)].season.count()  # Nb. could have used any column before count() in this case

In [71]:
#group by category
bikes.groupby('atemp_level').sum()

,instant,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
atemp_level,,,,,,,,,,,,,,,,
cool,11575184,2798,808,7369,19628,82,5886,1211,2819,396.66,380.8722,1158.40,447.2316,10836,137998,148834
mild,67259361,18873,3859,50929,84365,226,22825,5029,11128,2890.84,2875.4163,4798.51,1402.3544,165065,964761,1129826
warm,65875781,19812,3712,50471,86624,164,21301,5150,10026,4755.62,4455.4052,4614.17,1312.3134,391251,1407769,1799020
hot,6313184,1993,355,4851,10054,28,2189,475,797,594.02,556.8018,329.53,141.8069,52865,162134,214999

In [72]:
bikes.groupby('atemp_level').season.value_counts()

atemp_level  season
cool         1         1602
             4          236
             2           90
             3           24
mild         4         3079
             1         2449
             2         1829
             3          150
warm         3         3723
             2         2392
             4          917
             1          191
hot          3          599
             2           98
Name: season, dtype: int64

*Nb. The `atemp_level` variable we created is what the R language calls a "factor". Pandas has introduced a new data type called "category" that is similar to R's factors.*

# Synthetic Data

Sometimes we may want to generate test data, or we may need to initalise a series, matrix, or data frame for input to an algorithm. Numpy has several methods we can use for this.

Execute the following, then check the shape and content of each variable:

In [73]:
# Creating arrays with initial values
a = np.zeros(3) #shape of array filled with zeros
b = np.ones((1,3)) #shape of array (1, 3) filled with ones
c = np.random.randint(1,10,(2,3,4))   # randint(low, high, size), here 2 arrays, 3 rows, 4 columns
d = np.arange(4)
e = np.array([[1,2,3,4], [5,6,7,8]])

In [74]:
a

array([0., 0., 0.])

In [75]:
b

array([[1., 1., 1.]])

In [76]:
c

array([[[4, 6, 1, 3],
        [8, 8, 2, 7],
        [6, 9, 6, 3]],

       [[7, 7, 9, 8],
        [3, 8, 7, 4],
        [2, 7, 4, 4]]])

In [77]:
d

array([0, 1, 2, 3])

In [78]:
e

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

# Cleaning Data

## Load Data

Load rock.csv and clean the dataset.

In [79]:
rock = pd.read_csv("C:\\Users\\stoll\\iod_ipynb\\DATA\\rock.csv")
rock.head()

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

In [80]:
rock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2230 entries, 0 to 2229
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Song Clean    2230 non-null   object
 1   ARTIST CLEAN  2230 non-null   object
 2   Release Year  1653 non-null   object
 3   COMBINED      2230 non-null   object
 4   First?        2230 non-null   int64
 5   Year?         2230 non-null   int64
 6   PlayCount     2230 non-null   int64
 7   F*G           2230 non-null   int64
dtypes: int64(4), object(4)
memory usage: 139.5+ KB

## Check Column Names

Check column names and clean.

In [81]:
rock.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

Clean messy pandas column names with skimpy 

https://towardsdatascience.com/how-to-clean-messy-pandas-column-names-20dc7400cea7#:~:text=A%20lesser%20used%20function%20of,formats%20for%20standardizing%20column%20names

In [82]:
from skimpy import clean_columns

In [83]:
clean_df = clean_columns(rock)

8 column names have been cleaned

In [84]:
clean_df.columns

Index(['song_clean', 'artist_clean', 'release_year', 'combined', 'first',
       'year', 'play_count', 'f_g'],
      dtype='object')

In [85]:
#Alternatively, apply chaining method
rock.columns.str.lower().str.replace(' ', '_').str.replace('?', '').str.replace('*', '_')

C:\Users\stoll\AppData\Local\Temp\ipykernel_14388\2441015388.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  rock.columns.str.lower().str.replace(' ', '_').str.replace('?', '').str.replace('*', '_')
C:\Users\stoll\AppData\Local\Temp\ipykernel_14388\2441015388.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  rock.columns.str.lower().str.replace(' ', '_').str.replace('?', '').str.replace('*', '_')

Index(['song_clean', 'artist_clean', 'release_year', 'combined', 'first',
       'year', 'playcount', 'f_g'],
      dtype='object')

In [86]:
#Define you own function
def clean_column_names(column_names):
    clean_column=[]
    for name in column_names:
        clean_name = name.lower().replace(' ', '_').replace('?', '').replace('*', '_')
        clean_column.append(clean_name)
    return clean_column

In [87]:
# def clean_column_names(column_names):
#     clean_column=[]
#     for name in column_names:
#         clean_name = name.lower()
#         clean_name = clean_name.replace(' ', '_')
#         clean_column.append(clean_name)
#     return clean_column

In [88]:
clean_column_names(rock.columns)

['song_clean',
 'artist_clean',
 'release_year',
 'combined',
 'first',
 'year',
 'playcount',
 'f_g']

In [89]:
rock.columns = clean_column_names(rock.columns)
rock.head()

,song_clean,artist_clean,release_year,combined,first,year,playcount,f_g
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

## Replace Null Values With 0

Check 'release' column whether this column have any null value or not. Replace null value with 0.

In [90]:
rock.release_year.isnull().sum()

577

In [91]:
rock[rock.release_year.isnull()]

,song_clean,artist_clean,release_year,combined,first,year,playcount,f_g
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
10,"Baby, Please Don't Go",AC/DC,NaN,"Baby, Please Don't Go by AC/DC",1,0,1,0
13,CAN'T STOP ROCK'N'ROLL,AC/DC,NaN,CAN'T STOP ROCK'N'ROLL by AC/DC,1,0,5,0
16,Girls Got Rhythm,AC/DC,NaN,Girls Got Rhythm by AC/DC,1,0,24,0
24,Let's Get It Up,AC/DC,NaN,Let's Get It Up by AC/DC,1,0,4,0
...,...,...,...,...,...,...,...,...
2216,"I'm Bad, I'm Nationwide",ZZ Top,NaN,"I'm Bad, I'm Nationwide by ZZ Top",1,0,10,0
2218,Just Got Paid,ZZ Top,NaN,Just Got Paid by ZZ Top,1,0,2,0
2221,My Head's In Mississippi,ZZ Top,NaN,My Head's In Mississippi by ZZ Top,1,0,1,0
2222,Party On The Patio,ZZ Top,NaN,Party On The Patio by ZZ Top,1,0,14,0
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0

In [92]:
#replace missing values w/ 0 using loc
rock.loc[rock.release_year.isnull(), 'release_year'] = 0

In [93]:
rock.release_year.isnull().sum()

0

In [94]:
rock.head()

,song_clean,artist_clean,release_year,combined,first,year,playcount,f_g
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,0,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

## Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [95]:
rock.dtypes

song_clean      object
artist_clean    object
release_year    object
combined        object
first            int64
year             int64
playcount        int64
f_g              int64
dtype: object

In [96]:
rock.release_year.value_counts()

0                577
1973             104
1977              83
1975              83
1970              81
1971              75
1969              72
1980              70
1978              64
1979              63
1981              61
1967              61
1983              60
1976              56
1982              54
1984              51
1972              50
1974              48
1968              46
1985              39
1987              39
1986              37
1991              34
1989              32
1966              30
1988              29
1965              28
1994              25
1990              22
1993              19
1964              14
1992              14
1999              13
1995              10
1997               9
1963               9
1996               9
1998               6
2002               6
2005               5
2004               5
2012               5
2001               4
2007               3
1962               3
2000               3
2011               3
2003               3
2008               3
2014               2
2013               2
2006               1
SONGFACTS.COM      1
1071               1
1958               1
1955               1
1961               1
Name: release_year, dtype: int64

In [97]:
#turn SONGFACTS.COM into 0
rock.loc[rock.release_year == 'SONGFACTS.COM', 'release_year'] = 0 #or np.nan

In [98]:
rock.release_year.value_counts()

0       578
1973    104
1977     83
1975     83
1970     81
1971     75
1969     72
1980     70
1978     64
1979     63
1981     61
1967     61
1983     60
1976     56
1982     54
1984     51
1972     50
1974     48
1968     46
1985     39
1987     39
1986     37
1991     34
1989     32
1966     30
1988     29
1965     28
1994     25
1990     22
1993     19
1964     14
1992     14
1999     13
1995     10
1996      9
1997      9
1963      9
2002      6
1998      6
2005      5
2004      5
2012      5
2001      4
1962      3
2000      3
2011      3
2003      3
2008      3
2007      3
2013      2
2014      2
2006      1
1958      1
1071      1
1955      1
1961      1
Name: release_year, dtype: int64

In [99]:
rock.dtypes

song_clean      object
artist_clean    object
release_year    object
combined        object
first            int64
year             int64
playcount        int64
f_g              int64
dtype: object

In [100]:
#convert release_year to numeric 
rock.release_year = pd.to_numeric(rock.release_year)

In [101]:
rock.dtypes

song_clean      object
artist_clean    object
release_year     int64
combined        object
first            int64
year             int64
playcount        int64
f_g              int64
dtype: object

## Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

In [102]:
rock.describe()

       release_year   first         year    playcount          f_g
count   2230.000000  2230.0  2230.000000  2230.000000  2230.000000
mean    1465.331390     1.0     0.741256    16.872646    15.048430
std      867.196161     0.0     0.438043    25.302972    25.288366
min        0.000000     1.0     0.000000     0.000000     0.000000
25%        0.000000     1.0     0.000000     1.000000     0.000000
50%     1973.000000     1.0     1.000000     4.000000     3.000000
75%     1981.000000     1.0     1.000000    21.000000    18.000000
max     2014.000000     1.0     1.000000   142.000000   142.000000

In [117]:
def check_min_max(df):
    # Check min, max of each column
    print(df.describe().T[['min', 'max']])

In [118]:
check_min_max(rock)

              min     max
release_year  0.0  2014.0
first         1.0     1.0
year          0.0     1.0
playcount     0.0   142.0
f_g           0.0   142.0

min release_year of 0? > replace by nan

In [119]:
rock.loc[rock.release_year == 0, 'release_year'] = np.nan

In [120]:
check_min_max(rock)

                 min     max
release_year  1071.0  2014.0
first            1.0     1.0
year             0.0     1.0
playcount        0.0   142.0
f_g              0.0   142.0

min release_year of 1071? > replace by nan

In [121]:
rock.loc[rock.release_year == 1071, 'release_year'] = np.nan

In [122]:
check_min_max(rock)

                 min     max
release_year  1955.0  2014.0
first            1.0     1.0
year             0.0     1.0
playcount        0.0   142.0
f_g              0.0   142.0

## Write Some Functions

## Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [104]:
def check_song(row):
    print('Song:', row['song_clean'])
    print('Artist:', row['artist_clean'])
    print('Release before 1970:', row['release_year'] < 1970)
    print('\n')

## Write a function that converts cells in a DataFrame to float and otherwise replaces them with np.nan

In [105]:
def convert_to_float(column):
    column = pd.to_numeric(column, errors='coerce') #if ‘coerce’, then invalid parsing will be set as NaN
    return column

## Apply these functions to your dataset

In [106]:
def check_song(row):
    print('Song:', row['song_clean'])
    print('Artist:', row['artist_clean'])
    print('Release before 1970:', row['release_year'] < 1970)
    print('\n')

In [107]:
rock.iloc[3]

song_clean                     Rockin' Into the Night
artist_clean                              .38 Special
release_year                                     1980
combined        Rockin' Into the Night by .38 Special
first                                               1
year                                                1
playcount                                          18
f_g                                                18
Name: 3, dtype: object

In [108]:
check_song(rock.iloc[3])

Song: Rockin' Into the Night
Artist: .38 Special
Release before 1970: False

In [109]:
rock.head(3).apply(check_song, axis=1)

Song: Caught Up in You
Artist: .38 Special
Release before 1970: False


Song: Fantasy Girl
Artist: .38 Special
Release before 1970: True


Song: Hold On Loosely
Artist: .38 Special
Release before 1970: False

0    None
1    None
2    None
dtype: object

In [110]:
rock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2230 entries, 0 to 2229
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   song_clean    2230 non-null   object
 1   artist_clean  2230 non-null   object
 2   release_year  2230 non-null   int64
 3   combined      2230 non-null   object
 4   first         2230 non-null   int64
 5   year          2230 non-null   int64
 6   playcount     2230 non-null   int64
 7   f_g           2230 non-null   int64
dtypes: int64(5), object(3)
memory usage: 139.5+ KB

In [111]:
def convert_to_float(column):
    column = pd.to_numeric(column, errors='coerce') #if ‘coerce’, then invalid parsing will be set as NaN
    return column

In [112]:
rock.apply(convert_to_float) #default axis=0

,song_clean,artist_clean,release_year,combined,first,year,playcount,f_g
0,NaN,NaN,1982,NaN,1,1,82,82
1,NaN,NaN,0,NaN,1,0,3,0
2,NaN,NaN,1981,NaN,1,1,85,85
3,NaN,NaN,1980,NaN,1,1,18,18
4,NaN,NaN,1975,NaN,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,NaN,NaN,0,NaN,1,0,1,0
2226,NaN,NaN,1981,NaN,1,1,32,32
2227,NaN,NaN,1975,NaN,1,1,109,109
2228,NaN,NaN,1983,NaN,1,1,1,1
2229,NaN,NaN,1973,NaN,1,1,2,2

In [113]:
rock_float = rock.apply(convert_to_float)
rock_float.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2230 entries, 0 to 2229
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   song_clean    2 non-null      float64
 1   artist_clean  0 non-null      float64
 2   release_year  2230 non-null   int64
 3   combined      0 non-null      float64
 4   first         2230 non-null   int64
 5   year          2230 non-null   int64
 6   playcount     2230 non-null   int64
 7   f_g           2230 non-null   int64
dtypes: float64(3), int64(5)
memory usage: 139.5 KB

## Describe the new float-only DataFrame.

In [114]:
rock.describe()

       release_year   first         year    playcount          f_g
count   2230.000000  2230.0  2230.000000  2230.000000  2230.000000
mean    1465.331390     1.0     0.741256    16.872646    15.048430
std      867.196161     0.0     0.438043    25.302972    25.288366
min        0.000000     1.0     0.000000     0.000000     0.000000
25%        0.000000     1.0     0.000000     1.000000     0.000000
50%     1973.000000     1.0     1.000000     4.000000     3.000000
75%     1981.000000     1.0     1.000000    21.000000    18.000000
max     2014.000000     1.0     1.000000   142.000000   142.000000

In [115]:
rock.describe(include='all')

,song_clean,artist_clean,release_year,combined,first,year,playcount,f_g
count,2230,2230,2230.000000,2230,2230.0,2230.000000,2230.000000,2230.000000
unique,2158,475,NaN,2230,NaN,NaN,NaN,NaN
top,Summertime Blues,The Beatles,NaN,Caught Up in You by .38 Special,NaN,NaN,NaN,NaN
freq,3,100,NaN,1,NaN,NaN,NaN,NaN
mean,NaN,NaN,1465.331390,NaN,1.0,0.741256,16.872646,15.048430
std,NaN,NaN,867.196161,NaN,0.0,0.438043,25.302972,25.288366
min,NaN,NaN,0.000000,NaN,1.0,0.000000,0.000000,0.000000
25%,NaN,NaN,0.000000,NaN,1.0,0.000000,1.000000,0.000000
50%,NaN,NaN,1973.000000,NaN,1.0,1.000000,4.000000,3.000000
75%,NaN,NaN,1981.000000,NaN,1.0,1.000000,21.000000,18.000000
max,NaN,NaN,2014.000000,NaN,1.0,1.000000,142.000000,142.000000

In [116]:
rock_float.describe()

,song_clean,artist_clean,release_year,combined,first,year,playcount,f_g
count,2.000000,0.0,2230.000000,0.0,2230.0,2230.000000,2230.000000,2230.000000
mean,1012.000000,NaN,1465.331390,NaN,1.0,0.741256,16.872646,15.048430
std,1367.544515,NaN,867.196161,NaN,0.0,0.438043,25.302972,25.288366
min,45.000000,NaN,0.000000,NaN,1.0,0.000000,0.000000,0.000000
25%,528.500000,NaN,0.000000,NaN,1.0,0.000000,1.000000,0.000000
50%,1012.000000,NaN,1973.000000,NaN,1.0,1.000000,4.000000,3.000000
75%,1495.500000,NaN,1981.000000,NaN,1.0,1.000000,21.000000,18.000000
max,1979.000000,NaN,2014.000000,NaN,1.0,1.000000,142.000000,142.000000

>



---



---



> > > > > > > > > © 2022 Institute of Data


---



---